app/views/users/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  <% for buy_order in @buy_orders do %>
    <p> - <%= link_to Item.find_by_id(buy_order.item_id).name, order_path(buy_order) %> </p>

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 112], ["LIMIT", 1]]
---
  <% for sell_order in @sell_orders do %>
    <p> - <%= link_to Item.find_by_id(sell_order.item_id).name, order_path(sell_order) %> </p>