app/views/orders/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 112], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<h2> Item in order: </h2>
<p class="ml-5"> <%= link_to Item.find_by_id(@order.item_id).name, item_path(@order.item_id) %> </p>
<h2> Seller </h2>
<p class="ml-5"> <%= User.find_by_id(@order.seller_id).username %> </p>
<h2> Buyer </h2>
<p class="ml-5"> <%= User.find_by_id(@order.buyer_id).username %> </p>