app/controllers/bids_controller.rb

	def check_highest_price
		@item = Item.find_by_id(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def check_not_owner
		@item = Item.find_by_id(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def check_item_is_bidding
		@item = Item.find_by_id(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def create
		amount = bid_params[:amount].to_f
		@item = Item.find_by_id(params[:item_id])
		@item.highest_bidder_id = current_user.id
		@item.current_price = amount
		@item.save!

		@bid = @item.bids.new(bid_params)
		@bid.time_bidded = DateTime.now
		@bid.bidder_id = current_user.id
		@bid.save!
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
UPDATE "items" SET "highest_bidder_id" = $1, "current_price" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["highest_bidder_id", 2], ["current_price", 3.0], ["updated_at", "2019-11-13 01:52:49.785415"], ["id", 37]]
INSERT INTO "bids" ("item_id", "bidder_id", "amount", "time_bidded", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_id", 37], ["bidder_id", 2], ["amount", 3.0], ["time_bidded", "2019-11-13 01:52:49.807069"], ["created_at", "2019-11-13 01:52:49.814610"], ["updated_at", "2019-11-13 01:52:49.814610"]]