app/controllers/items_controller.rb

  def check_ownership
    @item = Item.find_by_id(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]

  def index

    @search = Item.where(status: :BIDDING).search(params[:q])
---
SELECT "items".* FROM "items" WHERE "items"."status" = $1  [["status", "BIDDING"]]

  def create
    @item = current_user.items.new(item_params)
    @item.time_listed = DateTime.now

    if @item.valid?
      @item.save!
---
INSERT INTO "items" ("name", "description", "current_price", "time_listed", "seller_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    id = params[:id]
    @item = Item.find(id)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]

  def update
    @item = Item.find(params[:id])
    if not item_params[:images].nil?
      for image in item_params[:images] do
        @item.images.attach(image)
      end
    end
    @item.update(item_params.except(:images))
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "fuck china's nazi ass"], ["updated_at", "2019-11-14 00:15:12.792479"], ["id", 2]]

  def delete_item_image
    @item = Item.find(params[:item_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]