app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def check_not_owner
    @item = Item.find_by_id(params[:id])