app/controllers/orders_controller.rb

	def show
		@order = Order.find_by_id(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]