app/controllers/users_controller.rb

	def show
		@user = current_user
		@items = current_user.items
		@bids = current_user.bids
		@buy_orders = Order.where(buyer_id: current_user.id)
		@sell_orders = Order.where(seller_id: current_user.id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = $1 LIMIT $2  [["buyer_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."seller_id" = ?  [["seller_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = $1 LIMIT $2  [["seller_id", 1], ["LIMIT", 1]]

	def update
		current_user.avatar.purge
		current_user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2019-11-13 10:36:38.411855"], ["id", 1]]